[
{
		"link":"2021-08-1",
		"title" : "August 2021 Issue",
		"desc" : "Get ready for MASK’s action-packed newsletter in the thrilling first August edition, filled with exciting reviews and brain-teasing puzzles to challenge your strategic skills."
},
{
		"link":"2021-09-1",
		"title" : "September 2021: Issue I",
		"desc" : "Embark on a thrilling isekai odyssey with the September Issue of the MASK newsletter! Explore immersive worlds through captivating reviews, and unlock hidden realms with curious crosswords!"
},
{
		"link":"2021-09-2",
		"title" : "September 2021: Issue II",
		"desc" : "Dive into an unknown Isekai realm with MASK’s second Issue of the September newsletter!"
},
{
		"link":"2021-10-1",
		"title" : "October 2021: Issue I",
		"desc" : "Delve into MASK’s October newsletter issue for heart-stopping horror and nail-biting thrills. Brace yourself for spine-tingling reviews and cryptic crosswords that will leave you craving for more!"
},
{
		"link":"2021-10-2",
		"title" : "October 2021: Issue II",
		"desc" : "Unleash your inner sleuth with MASK’s second Issue of the October newsletter and its spine-chilling reviews and mind-bending mystery crosswords."
},
{
		"link":"2022-12-1",
		"title" : "December 2022 Issue",
		"desc" : "Introducing the resplendent December edition of the MASK newsletter, an exquisite kaleidoscope of diverse anime genres! Embark on an mesmerising expedition of reviews, rankings, recommendations, and a riveting crossword."
},
{
		"link":"2023-02-1",
		"title" : "February 2023 Issue",
		"desc" : "With MASK's February issue, we bring to you, the ultimate romance newsletter, in a veritable delight, brimming with enchanting reviews, an exhilarating top 10 romance anime list, and your monthly dose of crossword. 心踊る！"
},
{
		"link":"2023-03-1",
		"title" : "March 2023 Issue",
		"desc" : "Behold, comrades! The March issue of the MASK newsletter, your sacred isekai haven, brims with captivating reviews, sagacious recommendations, and a perplexing crossword. Unleash the ethereal realms!"
},
{
		"link":"2023-04-1",
		"title" : "April 2023 Issue",
		"desc" : "Welcome to the captivating high-school themed April edition of the MASK newsletter! Immerse yourself in riveting reviews and rare recommendations that will leave you spellbound!"
},

{
		"link":"2023-05-1",
		"title" : "May 2023 Issue",
		"desc" : "Ahoy, fellow anime enthusiasts! The May issue of the MASK newsletter, be teeming with gripping action anime reviews, exhilarating news, enlightening ‘know your anime memes’, and an enigmatic crossword! Set sail now!"
},

{
	"link":"2023-11-1",
	"title" : "November 2023 Issue",
	"desc" : "Sayonara, November! December has burst onto the scene like an addictive OST, filled with joy and magic! 'Tis the season for warmth and celebration!"
},
{
	"link":"2023-12-1",
	"title" : "December 2022 Issue",
	"desc" : "Merry Christmas and New Year fellas! Hold on to your seats for MASK's December Newsletter. This time publishing articles on some of your favourite Fantasy anime. Get ready for an engaging read!"
}
]
